mainConfig = {
    "message": """
    Вы направились в категорию "Иностранному студенту"
    Выберите раздел, который подходит вам:
    Бакалавриат
    Магистратура
    Международная Магистратура
    Дополнительные возможности поступления
    Миграционные документы
    """,
    "tts": """
    Вы направились в категорию "Иностранному студенту".
    Выберите раздел, который подходит вам:
    Бакалавриат.
    Магистратура.
    Международная Магистратура.
    Дополнительные возможности поступления.
    Миграционные документы.
    """,
    "buttons": [
        "Бакалавриат",
        "Магистратура",
        "Международная Магистратура",
        "Дополнительные возможности поступления",
        "Миграционные документы",
        "Повторить ещё раз",
        "Что ты умеешь?",
        "Помощь",
        "Назад",
        "Выйти",
    ],
    "card": {
        "type": "BigImage",
        "image_id": "1030494/e955cc538c12dfb9bd3a",
        "title": "ИНОСТРАННОМУ СТУДЕНТУ",
        "description": """
        Выберите раздел, который подходит вам.
        """
    },
    "session_state": {"branch": "toAForeignStudent"},
}

bechelorConfig = {
    "message": """
    Вы направились в категорию "Иностранному студенту"
    Выберите раздел, который подходит вам:
    Бакалавриат
    Магистратура
    Международная Магистратура
    Дополнительные возможности поступления
    Миграционные документы
    """,
    "tts": """
    Вы направились в категорию "Иностранному студенту".
    Выберите раздел, который подходит вам:
    Бакалавриат.
    Магистратура.
    Международная Магистратура.
    Дополнительные возможности поступления.
    Миграционные документы.
    """,
    "buttons": [
        "Бакалавриат",
        "Магистратура",
        "Международная Магистратура",
        "Дополнительные возможности поступления",
        "Миграционные документы",
        "Повторить ещё раз",
        "Что ты умеешь?",
        "Помощь",
        "Назад",
        "Выйти",
    ],
    "card": {
        "type": "BigImage",
        "image_id": "1030494/e955cc538c12dfb9bd3a",
        "title": "ИНОСТРАННОМУ СТУДЕНТУ",
        "description": """
        бакалавриат
        """
    },
    "session_state": {"branch": "toAForeignStudent"},
}

magistracyConfig = {
    "message": """
    Вы направились в категорию "Иностранному студенту"
    Выберите раздел, который подходит вам:
    Бакалавриат
    Магистратура
    Международная Магистратура
    Дополнительные возможности поступления
    Миграционные документы
    """,
    "tts": """
    Вы направились в категорию "Иностранному студенту".
    Выберите раздел, который подходит вам:
    Бакалавриат.
    Магистратура.
    Международная Магистратура.
    Дополнительные возможности поступления.
    Миграционные документы.
    """,
    "buttons": [
        "Бакалавриат",
        "Магистратура",
        "Международная Магистратура",
        "Дополнительные возможности поступления",
        "Миграционные документы",
        "Повторить ещё раз",
        "Что ты умеешь?",
        "Помощь",
        "Назад",
        "Выйти",
    ],
    "card": {
        "type": "BigImage",
        "image_id": "1030494/e955cc538c12dfb9bd3a",
        "title": "ИНОСТРАННОМУ СТУДЕНТУ",
        "description": """
        магистратура.
        """
    },
    "session_state": {"branch": "toAForeignStudent"},
}

internationalMagistracyConfig = {
    "message": """
    Вы направились в категорию "Иностранному студенту"
    Выберите раздел, который подходит вам:
    Бакалавриат
    Магистратура
    Международная Магистратура
    Дополнительные возможности поступления
    Миграционные документы
    """,
    "tts": """
    Вы направились в категорию "Иностранному студенту".
    Выберите раздел, который подходит вам:
    Бакалавриат.
    Магистратура.
    Международная Магистратура.
    Дополнительные возможности поступления.
    Миграционные документы.
    """,
    "buttons": [
        "Бакалавриат",
        "Магистратура",
        "Международная Магистратура",
        "Дополнительные возможности поступления",
        "Миграционные документы",
        "Повторить ещё раз",
        "Что ты умеешь?",
        "Помощь",
        "Назад",
        "Выйти",
    ],
    "card": {
        "type": "BigImage",
        "image_id": "1030494/e955cc538c12dfb9bd3a",
        "title": "ИНОСТРАННОМУ СТУДЕНТУ",
        "description": """
        международная магистратура.
        """
    },
    "session_state": {"branch": "toAForeignStudent"},
}

additionalOpportsConfig = {
    "message": """
    Вы направились в категорию "Иностранному студенту"
    Выберите раздел, который подходит вам:
    Бакалавриат
    Магистратура
    Международная Магистратура
    Дополнительные возможности поступления
    Миграционные документы
    """,
    "tts": """
    Вы направились в категорию "Иностранному студенту".
    Выберите раздел, который подходит вам:
    Бакалавриат.
    Магистратура.
    Международная Магистратура.
    Дополнительные возможности поступления.
    Миграционные документы.
    """,
    "buttons": [
        "Бакалавриат",
        "Магистратура",
        "Международная Магистратура",
        "Дополнительные возможности поступления",
        "Миграционные документы",
        "Повторить ещё раз",
        "Что ты умеешь?",
        "Помощь",
        "Назад",
        "Выйти",
    ],
    "card": {
        "type": "BigImage",
        "image_id": "1030494/e955cc538c12dfb9bd3a",
        "title": "ИНОСТРАННОМУ СТУДЕНТУ",
        "description": """
        международная магистратура.
        """
    },
    "session_state": {"branch": "toAForeignStudent"},
}


migrationDocumentsConfig = {
    "message": """
    Вы направились в категорию "Иностранному студенту"
    Выберите раздел, который подходит вам:
    Бакалавриат
    Магистратура
    Международная Магистратура
    Дополнительные возможности поступления
    Миграционные документы
    """,
    "tts": """
    Вы направились в категорию "Иностранному студенту".
    Выберите раздел, который подходит вам:
    Бакалавриат.
    Магистратура.
    Международная Магистратура.
    Дополнительные возможности поступления.
    Миграционные документы.
    """,
    "buttons": [
        "Бакалавриат",
        "Магистратура",
        "Международная Магистратура",
        "Дополнительные возможности поступления",
        "Миграционные документы",
        "Повторить ещё раз",
        "Что ты умеешь?",
        "Помощь",
        "Назад",
        "Выйти",
    ],
    "card": {
        "type": "BigImage",
        "image_id": "1030494/e955cc538c12dfb9bd3a",
        "title": "ИНОСТРАННОМУ СТУДЕНТУ",
        "description": """
        доп. возможности для поступления.
        """
    },
    "session_state": {"branch": "toAForeignStudent"},
} 



def getMainConfig():
    return (
        {
            "message": mainConfig['message'],
            "tts": mainConfig['tts'],
            "buttons": mainConfig['buttons'],
            "card": mainConfig['card'],
            "session_state": mainConfig['session_state'],
        },
    )

def getBechelorConfig():
    return (
        {
            "message": bechelorConfig['message'],
            "tts": bechelorConfig['tts'],
            "buttons": bechelorConfig['buttons'],
            "card": bechelorConfig['card'],
            "session_state": bechelorConfig['session_state'],
        },
    )

def getMagistracyConfig():
    return (
        {
            "message": magistracyConfig['message'],
            "tts": magistracyConfig['tts'],
            "buttons": magistracyConfig['buttons'],
            "card": magistracyConfig['card'],
            "session_state": magistracyConfig['session_state'],
        },
    )

def getInternationalMagistracyConfig():
    return (
        {
            "message": internationalMagistracyConfig['message'],
            "tts": internationalMagistracyConfig['tts'],
            "buttons": internationalMagistracyConfig['buttons'],
            "card": internationalMagistracyConfig['card'],
            "session_state": internationalMagistracyConfig['session_state'],
        },
    )

def getAdditionalOpportsConfig():
    return (
        {
            "message": additionalOpportsConfig['message'],
            "tts": additionalOpportsConfig['tts'],
            "buttons": additionalOpportsConfig['buttons'],
            "card": additionalOpportsConfig['card'],
            "session_state": additionalOpportsConfig['session_state'],
        },
    )

def getMigrationDocumentsConfig():
    return (
        {
            "message": migrationDocumentsConfig['message'],
            "tts": migrationDocumentsConfig['tts'],
            "buttons": migrationDocumentsConfig['buttons'],
            "card": migrationDocumentsConfig['card'],
            "session_state": migrationDocumentsConfig['session_state'],
        },
    )
